{
    "version": "https://jsonfeed.org/version/1",
    "title": "Byte&#x27;s Projects",
    "description": "",
    "home_page_url": "https://byteafterlife.github.io/projects",
    "feed_url": "https://byteafterlife.github.io/projects/feed.json",
    "user_comment": "",
    "author": {
        "name": "Byte"
    },
    "items": [
        {
            "id": "https://byteafterlife.github.io/projects/i-made-social-credit-for-cats-and-learned-so-much/",
            "url": "https://byteafterlife.github.io/projects/i-made-social-credit-for-cats-and-learned-so-much/",
            "title": "I made social credit for cats (and learned so much)",
            "summary": "From my many years of dev experience, I've been building apps that follow this logic: Client connects to server &gt; Server does access verification and makes sure you can access what you wnt &gt; The server queries database &gt; Server returns response to client. But&hellip;",
            "content_html": "\n  <p>\n    From my many years of dev experience, I've been building apps that follow this logic: Client connects to server &gt; Server does access verification and makes sure you can access what you wnt &gt; The server queries database &gt; Server returns response to client. But this time, it was different, I had to make the database the server and use RLS and other database stuff for security.\n  </p>\n\n  <p>\n    I decided to take a break from self hosting and instead make worldwide apps via cloud providers this time.\n  </p>\n\n  <p>\n    Alright hold on back it up firstly.. how did I come up with this idea in the first place? Great question, I was laying, looked at my cat, and then.. \"I just got an idea\"\n  </p>\n\n  <p>\n    Anyway, theres a whole different type of apps that I like to call \"Direct Database Clients\" which basically means instead of there being a server between you and the database, and the server doing access verification, the database server itself uses a bunch of stuff like RLS and functions and triggers and stuff to verify if you're allowed to access or change what you want. I never made something like this EVER before, so it was pretty complicated.\n  </p>\n\n  <p>\n    Anyway, firstly I got to the drawing board. Here was my idea: People register cats, each cat has a profile photo, name, and a bio! And it's also obviously tied to you. Next, each cat has social credit, and theres leaderboards, like which has the most, or least, or longest name, or anything that I think of. But to change your cats social credit you have to make \"cases\", where you upload a video, give a short description of what it proves, and state how much it should affect your cats social credit. For example, I could take a video of my cat falling off the couch, then the description would be \"(my cat) fell off the couch!\" and the effect should be -10 social credit, because I believe my cat should lose that much because he fell off the couch lol. Anyway, then others vote on your case, and if you get 3 or more voted, then its considered \"processed\" and the cat's social credit was changed how it was stated when you made the case.\n  </p>\n\n  <p>\n    Now how would I implement this? Well get ready cause I had to do alot. The first thing that came to mind was storage. How do I store photos of people's cats, or their evidence videos? Well, over the years I learned alot of free tools that help me do stuff since I dont get any funding for any of these projects, and they're just for fun, but since I believe in Tragedy of the Commons, I won't share any tool names, sorry! Anyway, I found a storage system that integrates directly with my database provider. And now was the part I never done before: Connect directly to a database with client side javascript, so I got something called a \"public\" key, which was intended to be used clientside, so then I figured out they quite literally had everything I needed, authentication, a storage system, and databases, all on the same platform, perfect. So now how it worked is: Me and my friends login with discord then we get an access token, which can be used to upload stuff to the storage system and directly update the database. Now of course, I trust my friends, I know they wouldn't drop all tables (if you know nothing about databases, that basically permanently deletes all your data) probably. But still, I wanted to practice, especially since it was my first time making this type of app (that connects directly to storage and databases) So, after 6 hours of setting up soo many security things it was wild I swear, here's a rundown though of some big moments:\n  </p>\n\n  <p>\n    For the case votes, I tried storing them in a column inside the case itself with a uuid[] type, uuid means a unique ID for a user or something else, and the [] means its a table, it can have multiple values, but then I had a huge problem when trying to make it so people can only add or remove themselves from the table, eventually I gave up with it and made a new table with just two columns: case_id, and user_id, that was way easier to manage. Also, a bunch of times, for update policies (policies that run when you change a record) when I needed to check the old value before the new one, RLS doesn't have an OLD attribute (at least on my database provider) so I had to figure out functions.\n  </p>\n\n  <p>\n    I also at first thought the way social credit would be calculated would be each time the page loads, the user loads each case associated with a cat, checks the votes, if theres more than 3, it clientside calculates the social credit, that was very inefficient, and also I have limited database storage obviously on a free plan, so I needed something more optimized, so instead I made a function (a function can do more than RLS, like execute code on other tables, where RLS can only check rows in your current table) that when a vote is created for a case in my case votes table, if theres now 3 votes including this one, delete the case to save storage, update the cat's social credit directly by updating the new \"social_credit\" column on each cat, that saves database storage, but sadly since functions couldn't access the user storage part to delete the evidence file of the case, I just added it to a table that I have to manually check and delete the files manually. But now there was a problem, since people had update permission on their cat's to change the name or bio, they could also just directly update their cats social credit score to like \"9999999\" or something, that's not good. So I had to do some debugging, and guess what? The same internal database user that executes user created queries (like if I personally set the cats social credit score to 9999) also executes functions, like the one thats supposed to be able to change the cats social credit score. That's very bad. So I hit a brick wall, nothing online told me how to fix it, then I did some debugging by myself and somehow figured it out.. I'm starting to notice I'm really fixing lots of undocumented errors on things. Like in my <a href=\"https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/\">Jitsi series</a>\n  </p>\n\n  <p>\n    Another issue I ran into was the displaying the owner name under cats, see people couldn't really access the system table used for authentication, so I had to make a bridge function that basically whenever someone signed up (one of my friends) or their discord name changed, it would copy that into a table which sole purpose is just to store their user ID and their display name, and also a value called \"can_view\" which with RLS I made it so you cant get someones discord username if their can_view is FALSE, at first it was broken, but eventually I got it to work after alot of revisions.\n  </p>\n\n  <p>\n    Anyway, then I had to make pages to connect to the database. Making the pages and the leaderboards and the whole database side security was pretty complicated... but what did I expect, this is my first time making this type of app as I said.\n  </p>\n\n  <p>\n    For the leaderboard, if social credit ties, my super duper smart algorithm decides who gets 1st, 2nd, and 3rd place, you're not ready... whichever cat name comes first alphabetically gets the higher place and so on if a tie happens. I know so smart.\n  </p>\n\n  <p>\n    I also decided to use discord for login in the end because I didn't feel like storing passwords, and on Cat Index, people can see if you own a cat if you allow it using a setting in the top right.\n  </p>\n\n  <p>\n    I also decided to make the homepage a windows xp styled window manager thing that just iframes the pages (leaderboard, cases, cat index)&nbsp;and adds buttons. The red refresh icon refreshes you, so if you for example went to the cat creation page from the cases window and you're stuck, pressing the refresh button takes you back to the cases page. The Maximize button fullscreens the \"window\". Like this:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/16/Untitled-2025-11-07-1049.png\" height=\"1140\" width=\"2011\" alt=\"Fullscreened iframe\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/16/responsive/Untitled-2025-11-07-1049-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Untitled-2025-11-07-1049-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Untitled-2025-11-07-1049-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Untitled-2025-11-07-1049-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Untitled-2025-11-07-1049-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Untitled-2025-11-07-1049-2xl.png 1920w\">\n      <figcaption>Fullscreened iframe</figcaption>\n    </figure>\n\n  <p>\n    You can also minimize windows, which removes a green little bar on the bottom that was supposed to make the aesthetic look more like windows xp. For the cat/case creation pages, I made it look like a terminal sort of thing because why not? :)\n  </p>\n\n  <p>\n    Anyway here's some screenshots\n  </p>\n\n  <div  class=\"gallery-wrapper gallery-wrapper--full\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/16/gallery/Untitled-2025-11-07-1048.png\" data-size=\"2482x1405\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/16/gallery/Untitled-2025-11-07-1048-thumbnail.png\" height=\"408\" width=\"720\" alt=\"Beside Social Cat-It is discord usernames, which I'd prefer to keep hidden, and for those complaining that the top photo of bunny in a bathtub is squished, that was done intentionally for this screenshot to include a case which I already voted on.\" >\n      </a>\n      <figcaption>Beside Social Cat-It is discord usernames, which I'd prefer to keep hidden, and for those complaining that the top photo of bunny in a bathtub is squished, that was done intentionally for this screenshot to include a case which I already voted on.</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/16/gallery/Untitled-2025-11-07-1050.png\" data-size=\"2325x1316\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/16/gallery/Untitled-2025-11-07-1050-thumbnail.png\" height=\"408\" width=\"720\" alt=\"Showing off the cat index, mouse hovering over my cat bunny\" >\n      </a>\n      <figcaption>Showing off the cat index, mouse hovering over my cat bunny</figcaption>\n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/16/gallery/Untitled-2025-11-07-1051.png\" data-size=\"2402x1360\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/16/gallery/Untitled-2025-11-07-1051-thumbnail.png\" height=\"408\" width=\"720\" alt=\"When in cat edit mode, hovering over image to show you can change the image too!\" >\n      </a>\n      <figcaption>When in cat edit mode, hovering over image to show you can change the image too!</figcaption>\n    </figure>\n    </div>\n  </div>\n<div><video loading=\"lazy\" controls> <source src=\"/projects/media/files/2025-12-29%2009-20-02.mp4\" type=\"video/mp4\"></video  ></div>\n\n  <p>\n    Was this worth it? Absolutely! Forget social media platforms we now have cat social credit media.. lol.\n  </p>\n\n  <p>\n    Some P.S. 1. when I was debating whether setting up a policy to only let you make cases about your own cat, I decided not to because if you have an incriminating video of your friends cat (like if it fell off the couch) you can make a case on your friends cat. Also, if you don't attach any evidence for a case (no picture or video) then it just says \"Trust me bro\" as the evidence hehe\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/16/Screenshot-from-2025-12-29-09-36-46.png\" height=\"148\" width=\"346\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/16/responsive/Screenshot-from-2025-12-29-09-36-46-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Screenshot-from-2025-12-29-09-36-46-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Screenshot-from-2025-12-29-09-36-46-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Screenshot-from-2025-12-29-09-36-46-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Screenshot-from-2025-12-29-09-36-46-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/16/responsive/Screenshot-from-2025-12-29-09-36-46-2xl.png 1920w\">\n      \n    </figure>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-29T09:22:37-06:00",
            "date_modified": "2025-12-29T10:22:12-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/i-did-not-expect-to-learn-this-while-making-a-jitsi-server/",
            "url": "https://byteafterlife.github.io/projects/i-did-not-expect-to-learn-this-while-making-a-jitsi-server/",
            "title": "I did not expect to learn this while making a Jitsi server",
            "summary": "In my last post of the Jitsi server series, I setup client certificate authentication to log people in securely into my server if they're on mobile data and they cant be authorized by their IP (because its constantly changing). Same day yesterday, I tried making&hellip;",
            "content_html": "\n  <p>\n    In my <a href=\"https://byteafterlife.github.io/projects/my-jitsi-project-is-really-getting-huge-client-certificate-authentication/\">last post</a> of the Jitsi server series, I setup client certificate authentication to log people in securely into my server if they're on mobile data and they cant be authorized by their IP (because its constantly changing). Same day yesterday, I tried making a client certificate for one of my family members, as I did, it said \"Certificate password is incorrect\" when I tried importing the PFX on their system, and I was super confused, I even tried verifying the password myself with openssl, and it worked. Today, I tried making one for another family member, and on their phone, same thing, \"Enter correct password\" it said. I was so confused. Why? The password was correct. I even tried empty passwords (yes, you can make pfx's with empty passwords if you didnt know) AND IT STILL SAID WRONG. YOU CANNOT MAKE A TYPO ON A EMPTY PASSWORD. I knew I'm not going crazy.. right? They typed it correctly, I tried an empty one, they didnt type anything, and it still said its wrong. WHYYYY. I already knew its probably something with compatibility, my system is very up to date, theirs.. well I wont say. Anyway, I WAS RIGHT. 2 hours ago, I discovered the encryption algorithm that my certificate creator was using by default was not compatible with older devices. I then bragged to myself about how I knew it was something with compatibility because I had to let it out. Anyway, then after some extra parameters in the final command to bundle the key and certificate into a cute pfx, it actually imported successfully. See? I knew I wasn't going crazy. I KNEW ITTTTT. Anyway, now I learned that pfx's have different algorithms for.. encrypting themselves. Damn like just stick to one. In my family members' older devices' defense, it was saying the password was wrong because it couldn't decrypt the keys and certificates with the password because it was using a more secure and modern encryption algorithm that they have not ever seen in their lives.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-22T14:27:27-06:00",
            "date_modified": "2025-12-22T14:29:07-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/my-jitsi-project-is-really-getting-huge-client-certificate-authentication/",
            "url": "https://byteafterlife.github.io/projects/my-jitsi-project-is-really-getting-huge-client-certificate-authentication/",
            "title": "My Jitsi Project is really getting huge (client certificate authentication)",
            "summary": "So in my last post of the Jitsi series, I explained how I did IP based blocking to control who can connect via a reverse proxy, but then I realized something. My IP can change, especially on mobile data. Which is bad, because then I&hellip;",
            "content_html": "\n  <p>\n    So in my <a href=\"https://byteafterlife.github.io/projects/my-silly-access-denied-page/\">last post</a> of the Jitsi series, I explained how I did IP based blocking to control who can connect via a reverse proxy, but then I realized something. My IP can change, especially on mobile data. Which is bad, because then I wont be able to call on the go, very bad! So what did I do? Well I decided to try client certificate authentication, how it works is you basically install a certificate on your device (in this case, my phone) which is a file that basically proves your identity, then when my reverse proxy asks my phone to give a certificate and I pick the one, it checks if the certificate you provide was created by me and its valid, and if yes, then it grants you access, even if your IP isn't authorized, and if you dont provide a certificate, or dont have (a valid) one, but your IP is authorized, you're allowed access, and finally if your IP isn't authorized and you dont provide a valid certificate, you are just rejected access with my silly block page.\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/14/Screenshot_20251221_142521_Key-Chain~2.jpg\" height=\"2340\" width=\"1080\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-xs.jpg 640w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-sm.jpg 768w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-md.jpg 1024w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-lg.jpg 1366w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-xl.jpg 1600w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-2xl.jpg 1920w\">\n      <figcaption>My phone asking me to select a certificate to log into the srver</figcaption>\n    </figure>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-21T14:23:26-06:00",
            "date_modified": "2025-12-21T14:30:38-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/my-silly-access-denied-page/",
            "url": "https://byteafterlife.github.io/projects/my-silly-access-denied-page/",
            "title": "My silly access denied page",
            "summary": "I never expected my jitsi setup to get this complicated. Yesterday I had to build a custom auth server for JWT, today I had to setup IP controls. Basically, some weird data center company which I won't be naming keeps trying to access some weird&hellip;",
            "content_html": "\n  <p>\n    I never expected <a href=\"https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/\">my jitsi setup</a> to get this complicated. Yesterday I had to build a custom auth server for JWT, today I had to setup IP controls. Basically, some weird data center company which I won't be naming keeps trying to access some weird paths like \"/SETTINGS.CFG\" or \"/MainLogin.asp\" which don't even exist and instead make them join a jitsi meeting called \"Settings Cfg\" and \"MainLogin Asp\" lmao. So I decided to make my own access denied page once and for all to deal with them.\n  </p>\n\n  <p>\n    See, I'm tired of the boring old 403 pages like \"Access denied\" or \"Failure!\" No no no. This is my server, I style it how I want. So I made my access denied page have a personality. Best one I've ever seen. Here's a screenshot\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/13/Screenshot-from-2025-12-21-13-06-07.png\" height=\"1079\" width=\"1919\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Like it?\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-21T13:06:30-06:00",
            "date_modified": "2025-12-21T14:23:40-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/",
            "url": "https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/",
            "title": "Jitsi is... complicated. How I fixed it is wild.",
            "summary": "As a followup to my Jitsi setup post. I decided I need something more flexible, JWT authentication. Now, I remember I mentioned using plugins to setup auto lobby starting. But today, I needed a new plugin, (not responsible for external content)&nbsp;token_moderation. But it didn't work,&hellip;",
            "content_html": "\n  <p>\n    As a followup to my <a href=\"https://byteafterlife.github.io/projects/bye-mumble-hello-jitsi/\">Jitsi setup post</a>. I decided I need something more flexible, JWT authentication. Now, I remember I mentioned using plugins to setup auto lobby starting. But today, I needed a new plugin, (not responsible for external content)&nbsp;<a href=\"https://github.com/nvonahsen/jitsi-token-moderation-plugin/blob/master/mod_token_moderation.lua\">token_moderation</a>. But it didn't work, my logs said\n  </p>\n<pre class=\"line-numbers  language-html\"><code>modulemanager error Unable to load module 'token_moderation': /usr/lib/prosody/modules/share/lua/5.4/mod_token_moderation/mod_token_moderation.lua: No such file or directory</code></pre>\n\n  <p>\n    and I was confused. Because plugins are supposed to be read from\n  </p>\n<pre class=\"line-numbers  language-html\"><code>/prosody-plugins-custom\n</code></pre>\n\n  <p>\n    But it was reading them from that /usr/lib thing, I was confused. I checked the compose, it was mapping it as\n  </p>\n<pre class=\"line-numbers  language-html\"><code>- ${CONFIG}/prosody/prosody-plugins-custom:/prosody-plugins-custom:Z</code></pre>\n\n  <p>\n    just as the OFFICIAL FILE (remember that for later) wrote. So then I checked the container itself inside \"/prosody-plugins-custom\" and guess what? It wasn't even there. I was so confused, because it was loading the auto lobby start plugin successfully, this one it wasn't, and none were even showing up in the folder.. this makes no sense. But then I checked the folders inside \"/\" (the root) and I found one called \"prosody-plugins-contrib\" HUH??? And I opened it.. oh my god. It had all the plugin I used last post.. HARD WIRED INTO THE DEPLOYMENT? So here's what was happening: None of the custom plugins I added were ever added to jitsi's access in the first place, the auto lobby worked though. BUT THATS BECAUSE IT WAS IN A BUILTIN FOLDER THAT INCLUDED EVERY PLUGIN FROM THE REPOSITORY I DOWNLOADED THE AUTO LOBBY ONE FROM. So it was never getting it from \"/prosody-plugins-custom\" Ok.. that made more sense, because the folder was empty, so at least it wasn't pulling the auto lobby out of thin air.. but why was it empty? Well, I checked the mount path again,\n  </p>\n<pre class=\"line-numbers  language-html\"><code>- ${CONFIG}/prosody/prosody-plugins-custom:/prosody-plugins-custom:Z</code></pre>\n\n  <p>\n    And then I thought, ok well what's \"CONFIG\" AND THEN IT HIT ME.. CONFIG IS \"~/.jitsi-meet-cfg\" and I then realized.. it was reaading /prosody-plugins-custom from MY HOME DIRECTORY, NOT FROM THE PROJECT FOLDER. So I changed \"CONFIG\" to \"./\" (here's the .env update incase you had the same issue):\n  </p>\n<pre class=\"line-numbers  language-html\"><code>  CONFIG=./</code></pre>\n\n  <p>\n    And guess what.. it worked\n  </p>\n\n  <p>\n    This may seem simple but oh my, look from my perspective at the start: I put two plugins in the same folder, one loads fine, other is marked as not found, the folder according to Jitsi itself is empty, so how does the first one load fine, it it spawning it out of thin air!?\n  </p>\n\n  <p>\n    I don't know if I should be more concerned about the fact that the official example is that confusing, or that they hardbaked every contrib plugin into the official docker compose file.\n  </p>\n\n  <p>\n    Either way, as a summary, what happened is when I added those two plugins to the custom plugins folder that I THOUGHT would work, it didn't because CONFIG was set to the wrong folder on my host, it never actually was reading the auto lobby one from the custom plugins folder, which was empty according to it, it was instead reading it from a hard wired folder that was in it, which made me think it was reading it correctly, then when I added a plugin NOT from the contrib repository, since it wasn't hard baked into the image, it didn't even see it in the custom plugins, because it never saw anything in the custom plugins because \"${CONFIG}\" was set to the wrong value this whole time. Once I changed it to \"CONFIG=./\" the custom plugins folder was no longer empty, and it saw all my custom plugins again, yay. How confusing. I find it wild that I figured all that out. Also of course, no documentation told me that there was this hard baked folder, and nothing explained how to fix it. So I had to figure all this out myself. And somehow suceeded.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-20T14:26:42-06:00",
            "date_modified": "2025-12-20T14:46:08-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/ssh-tunneling-is-cooler-than-i-thought/",
            "url": "https://byteafterlife.github.io/projects/ssh-tunneling-is-cooler-than-i-thought/",
            "title": "SSH tunneling is cooler than I thought",
            "summary": "I've known about SSH tunnelling for a long time, I never actually know how it works though. Now I learned how it actually works and it's so much better. Basically how it works is if you want to access things on another computer that are&hellip;",
            "content_html": "\n  <p>\n    I've known about SSH tunnelling for a long time, I never actually know how it works though. Now I learned how it actually works and it's so much better. Basically how it works is if you want to access things on another computer that are locked down, you can use a program called SSH to make a tunnel into that computer and access the things on it, and it also binds to a port, which is kind of like a room in your computer, and forwards it to another room in the other computer, so lets say on port 8080 on your remote computer, you're hosting a secret website, but it can't be accessed through the internet for whatever reason, or doesn't have HTTPS. You can make an SSH tunnel into the computer, and as long as SSH can be accessed from anywhere, anything on that computer can be accessed from anywhere. It's pretty cool. It also encrypts stuff so if your program can't encrypt connections when needed, like no HTTPS, SSH does it for you.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-20T10:57:54-06:00",
            "date_modified": "2025-12-20T10:57:54-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/i-made-my-own-encoding-language-out-of-shapes/",
            "url": "https://byteafterlife.github.io/projects/i-made-my-own-encoding-language-out-of-shapes/",
            "title": "I made my own encoding language.. out of shapes",
            "summary": "Firstly, I'll just say, I get lots of ideas that I then later discover were thought of like 2 decades ago by someone else, so if this is another one of those times and someone already made this, then sorry, I didn't research it or&hellip;",
            "content_html": "\n  <p>\n    Firstly, I'll just say, I get lots of ideas that I then later discover were thought of like 2 decades ago by someone else, so if this is another one of those times and someone already made this, then sorry, I didn't research it or anything, I just made this for fun. Also this went through many revisions because I got more ideas for what to add and probably will get more, if they do, I'll make sure to post it here!\n  </p>\n\n  <p>\n    So I was bored one day and came up with a encoding language.. There's 2 rows. One is the \"grouping\" row, the next is the \"index\" row as I call it, you group the alphabet letters into groups of 3, so group 1 is \"ABC\", group 2 is \"DEF\", 3 is \"GHI\", and group 9 is \"YZ\" now, originally I didnt plan to use shapes, I planned to use dots. Anyway how the rows used to work is the first row, the \"grouping\" row is for which group of letters your letter is in, let's say I want to write the message \"Hi\" what we'd do is since the letter \"H\" is in the \"GHI\" group, which is 3, we put 3 dots in the first column, first row, to represent \"GHI.\" by the way you can make these rows with just some simple lines, nothing complicated like a special algorithm for the columns. Now, in the second row, first column, we'd put two dots, why? well H is 2nd in the \"GHI\" group just like that, we wrote H in my silly language, for I, 2nd column first row would be 3 dots again for \"GHI\", then 3 dots 2nd row 2nd column for I. And we just wrote \"HI\" (haven't invented capitalisation yet!) Also I didn't really make a requirement for how the dots have to be placed, you can put them in a straight line, a triangle for 3, square for 4, whatever, as long as its within the row and row and column. Here's what it would look like saying \"HI\"\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl1-2.png\" height=\"230\" width=\"209\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Also I made sure to place the dots randomly to show THE DOT PLACEMENT DOESNT MATTER as long as its contained in your cell (row and column). Now, this was V1 of my secret language, so once when I arranged the dots like a triangle, I realized \"Wait why don't we just use shapes?\" So I decided to use shapes. Also you may use a dot for 1, so for \"A\" you would put a dot in column 1 row 1, and another in column 1 row 2. Now \"HI\" looked like this:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl2.png\" height=\"230\" width=\"209\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Also the orientation doesn't matter of the shape, you can make horizontal or vertical lines, upside down triangles, sideways triangles, squares at a 45 degree angle, anything, as long as the vertices match what you want. Simply just count the vertices and that's the dot, a triangle has 3 vertices, so that equals \"3\" or the 3rd group, \"GHI\" and a line has 2, the 2nd letter in the GHI group, just like that, we got \"HI\" but out of shapes. Then in class when I was experimenting with it, I realized.. \"Wait what if I just flipped it upside down\" Since the orientation of the shapes doesn't matter to me, you can make a upside down triangle, but now what if you got it upside down (the H and I on the top is just for guidance, if using for real, which I'd be surprised if you did, you wouldn't write the decoded letter above it) So what if you got it upside down, then it would look like this?\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl3.png\" height=\"230\" width=\"215\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Now it says \"IF\".. HUH? NO! I wanted to say Hi! NOT IF. So what did I do? make an orientation symbol. The orientation symbol is an \"O\" with a line under it. and it always goes on top of the code. So Hi would look like this now with V3 (my orientation symbol update lol)\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl4.png\" height=\"321\" width=\"214\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    You just gotta follow the global rule of \"O symbol is always above\" now if i turn it any direction, the O symbol wouldn't be on top, which would signal to the reader to fix the orientation. Also, once when I wanted to write \"S\" I didn't feel like drawing a shape with 7 sides, so you can also put multiple shapes into a cell as long as the vertices add up to what you wanted&nbsp;originally, so a square and a triangle's vertice count adds up to 7, which would be the \"STU\" group. then draw a simple dot for the 1st letter in \"STU\", \"S\" and you got S. Here's an example:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl5.png\" height=\"262\" width=\"162\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-2xl.png 1920w\">\n      <figcaption>S</figcaption>\n    </figure>\n\n  <p>\n    Now, here's a challenge, try decoding this, it's a bit hard, remember orientation!:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl6.png\" height=\"696\" width=\"415\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    (DO NOT SCROLL FURTHER UNLESS DONE OR AREN'T DOING IT, YOU WILL SEE THE ANSWER)\n  </p>\n\n  <p>\n    (DO NOT SCROLL FURTHER UNLESS DONE OR AREN'T DOING IT, YOU WILL SEE THE ANSWER)\n  </p>\n\n  <p>\n    (DO NOT SCROLL FURTHER UNLESS DONE OR AREN'T DOING IT, YOU WILL SEE THE ANSWER)\n  </p>\n\n  <p>\n    If you have trouble, the answer is YOUREAWESOME\n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    Also the 2nd row should always have less than 4 vertices. Since letters are grouped in 3, and a group cannot have more than 3, if you see a square in the second row ( with correct orientation, of course) then it's a mistake since a square has 4 vertices\n  </p>\n\n  <p>\n    I also made another edition called \"Additive\", which instead of using groups and indexes of letters in those groups, uses the closest group to the letter, and the second row is addition to get to that letter. So D would be a single dot in the top row, which would be.. \"ABC\"? What??? Yes, in my first edition, that wouldn't make sense. But in this edition, the second row would be one more dot, which would signal \"what's 1 letter after C?\" which is D. so D would look like this in my Additive edition:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl7.png\" height=\"138\" width=\"150\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    The first row always equals the last letter of the group, so if you drew a triangle, which would mean the group \"GHI\", \"I\" would be the letter, then the second dot would be what you want to add, so if you want to write \"K\", you would make a triangle in the top row for \"GHI\", then the second row would have a line or any other two vertices shape, which would mean \"I\" + 2, which would be \"K\"\n  </p>\n\n  <p>\n    This is a really silly idea I had, if you want to try using it, have fun! Much thanks for reading. Also I know this isn't my usual tech stuff but I found it a fun post to make for those interested in encoding and stuff.\n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    UPDATE: I concluded theres no way to add spaces, so like if you wanna add a space, just keep one column empty, so \"Hi there\" now looks like:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/slupdate.png\" height=\"177\" width=\"338\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-2xl.png 1920w\">\n      \n    </figure>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-06T09:57:11-06:00",
            "date_modified": "2025-12-21T09:22:18-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/bye-mumble-hello-jitsi/",
            "url": "https://byteafterlife.github.io/projects/bye-mumble-hello-jitsi/",
            "title": "Bye Mumble, Hello Jitsi",
            "summary": "So, as I discussed in my Mumble setup&nbsp;post, I made my own mumble server and port forwarded to make it accessible to the world! However, my family didn't like the limits: No video, no screensharing. Now, I've known about Jitsi Meet for a while. Not&hellip;",
            "content_html": "\n  <p>\n    So, as I discussed in my <a href=\"https://byteafterlife.github.io/projects/my-first-worldwide-project-mumble/\">Mumble setup</a>&nbsp;post, I made my own mumble server and port forwarded to make it accessible to the world! However, my family didn't like the limits: No video, no screensharing. Now, I've known about <a href=\"https://jitsi.org\">Jitsi Meet</a> for a while. Not the cloud hosted one they provide, but the self hosted one. Jitsi Meet is a self hostable server app that lets you have meetings with people (screenshare and video and much more included) Now I'm gonna be completely transparent and say I've failed lots of times setting up an actually working Jitsi server. But this time it was surprisingly easy, I downloaded their pre-made <a href=\"https://byteafterlife.github.io/projects/the-docker-rabbit-hole/\">docker</a> compose file, it worked surprisingly! I was expecting 3 hours of debugging to just get the welcome screen, let alone a working meeting. But surprisingly, it worked first try, I got into a meeting, and everything was working. Now, I needed some form of authentication, if this was internally running on my LAN network, it wouldn't matter too much, but if I'm gonna port forward this and make it publicly accessible, I need some sort of security. Then I found myself configuring it to use an LDAP backend, and I added to the docker compose file an <a href=\"https://github.com/lldap/lldap\">LLDAP</a>&nbsp;(Light LDAP) (not LDAP) server. LLDAP is the simplest implementation of an LDAP server I know. It requires minimal setup, and definitely doesn't require 1 hour of commands to add an attribute. It even includes a web interface to manage users. Awesome! Now I was originally considering using Jitsi's internal user system for authentication, because Jitsi's user auth manager, prosody, lets you just internally create users with passwords in it's database and you can use that. But I like a clean web UI, so yes, I deployed a LDAP server just so I get a pretty web interface for managing users. I don't care that much, this isn't a enterprise grade server for millions of concurrent clients, I'm running these off my laptop for ~4 people, so I don't mind too much on resource usage. So just like that, my stack is done! Jitsi meet + LDAP for user management was epic. Then I setup the port forwarding and stuff, and just like that, we did it! Here's some screenshots.\n  </p>\n\n  <div  class=\"gallery-wrapper gallery-wrapper--wide\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-02-53.png\" data-size=\"1919x951\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-02-53-thumbnail.png\" height=\"357\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-01-06.png\" data-size=\"590x141\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-01-06-thumbnail.png\" height=\"141\" width=\"590\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-04-06.png\" data-size=\"416x385\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-04-06-thumbnail.png\" height=\"385\" width=\"416\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n  <p>\n    UPDATE: Ok so something was very wrong, any user that joins gets moderator rights... so what I had to do is enable guests, then take a completely different approach. Instead of everyone in my family having an account on LDAP, I just have one, since I guess Jitsi just gives all LDAP users moderator in meetings. But now that guests are enabled, anyone can join the meeting. The only time they cant is when a moderator isn't in the meeting, but if a moderator is in the meeting, they can just join, now I could enable the lobby, which would 100% solve the problem, but what if I forget? Well I just discovered a <a href=\"https://github.com/jitsi-contrib/prosody-plugins/tree/main/lobby_autostart_on_owner\">community made plugin called \"lobby_autostart_on_owner\"</a>&nbsp;(not responsible for external content) that automatically enables the lobby after a moderator joins to prevent users from joining without a moderator's permission. Gotta love open source. So the new flow: Only I have an account, the lobby is automatically enabled whenever I join so I don't have to remember to myself. Fine solution for now I guess, I also removed LLDAP completely since all that just for one user account is a bit too much, so now its just internally managed via that prosody internal database I mentioned earlier.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-06T08:50:38-06:00",
            "date_modified": "2025-12-20T14:27:32-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/i-made-my-own-vpn/",
            "url": "https://byteafterlife.github.io/projects/i-made-my-own-vpn/",
            "title": "I made my own VPN (second worldwide project)",
            "summary": "Everytime on my phone when I use my Mobile Data, or connect to an open wifi like at an airport or store, people say it's good to use a VPN, now when people think of VPNs they think of something that you pay for and&hellip;",
            "content_html": "\n  <p>\n    Everytime on my phone when I use my Mobile Data, or connect to an open wifi like at an airport or store, people say it's good to use a VPN, now when people think of VPNs they think of something that you pay for and it masks your IP anywhere you go, that's true, that's what a common VPN does. But, the way VPNs work is basically you pay to be able to connect to a network of computers that are told to forward your network requests (loading a webpage, making a search, logging in, etc) through them. It's actually really easy to make your own VPN server, and it probably costs less too, get a VPS (not a VPN) which is basically your own computer in the cloud that you rent, yes it's still paid, what do you expect. It functions just like you owned a computer at your house, except its in the cloud, now you run VPN software on it (OpenVPN, WireGuard, etc), set it up, connect, and you're done, now anywhere you go, your IP is now of the cloud computer that you're renting. However since I don't get funded for any of my projects, what if instead of running this VPN software on a cloud computer, I ran it on my own? I trust my own wifi router more than some random coffee shop wifi anyway, so I setup my very own WireGuard server, and then configured it on my phone, yes by the way I had to also setup port forwarding and firewalls, I'm trying to expand my knowledge of port forwarding and know better at making worldwide accessible servers from my computer, like the <a href=\"https://byteafterlife.github.io/projects/my-first-worldwide-project-mumble/\">Mumble server</a> I made 2 days ago, which also involved port forwarding and firewall config. Anyway back to WireGuard, now, here's the flow\n  </p>\n\n  <p>\n    My phone connects to mobile data or a public wifi &gt; I turn connect to my laptop's worldwide accessible VPN &gt; Any network traffic I do like searching or loading a webpage is extremely hard to be seen by the admins of the wifi I connected to &gt; My laptop makes the network request using my router at home &gt; router completes the request &gt; sends it to my laptop which sends it back to my phone, done.\n  </p>\n\n  <p>\n    Here's an example if I wanted to search \"hi\" on google: Phone searches hi (connected to my laptop VPN) &gt; Laptop searches it up using the home Wifi, as if I was at home and I searched \"hi\" using the home wifi &gt; the router responds and gives me the results &gt; my laptop returns it back to my phone which could be wherever in the world.\n  </p>\n\n  <p>\n    Of course I used docker to keep my docker skills sharp.\n  </p>\n\n  <p>\n    Heres a mobile screenshot\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/8/Screenshot_20251130_155702_WireGuard.jpg\" height=\"2340\" width=\"1080\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-xs.jpg 640w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-sm.jpg 768w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-md.jpg 1024w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-lg.jpg 1366w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-xl.jpg 1600w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-2xl.jpg 1920w\">\n      \n    </figure>\n\n  <p>\n    This is now my second worldwide accessible project EVER. And only 3 days after my first one. Woo!\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-11-30T13:00:44-06:00",
            "date_modified": "2025-11-30T15:58:37-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/using-linux-as-my-main-os-for-the-first-time/",
            "url": "https://byteafterlife.github.io/projects/using-linux-as-my-main-os-for-the-first-time/",
            "title": "Using Linux as my Main OS for the first time",
            "summary": "Ever since August 2024, I've been using Linux as my main OS. Why? Well it's more private, they don't install unnecessary apps like other OS's, and you can customize it as much as you want. Simple. I also like it because lots of servers use&hellip;",
            "content_html": "\n  <p>\n    Ever since August 2024, I've been using Linux as my main OS. Why? Well it's more private, they don't install unnecessary apps like other OS's, and you can customize it as much as you want. Simple. I also like it because lots of servers use it and in the future if I administer servers, learning linux is good, so far I know alot, package managers, software, fun easter eggs, etc. I like it, I also like something called \"LUKS\" which is basically a encryption system that encrypts your drive data, I'm not interested in that part, I like the way it stores the encryption key.. Instead of your password being the encryption key, the encryption key is actually a random string from what I know, and THAT string is encrypted with your password, so your password is used to get that encryption key to decrypt your data. But with that.. You can setup multiple \"slots\" or holders of that encrypted encryption key copy.. Like a security key could hold the same encryption key, and decrypt your data. I find it a creative idea!\n  </p>\n\n  <p>\n    Also, as I said it's really customizable. I added a notepad widget to my screen, a extension to make my screen more red, and way more that's not included in this screenshot, but here's my desktop.\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/7/Untitled-2025-11-07-1049.png\" height=\"826\" width=\"1452\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-2xl.png 1920w\">\n      \n    </figure>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-11-29T09:09:20-06:00",
            "date_modified": "2025-11-29T09:36:31-06:00"
        }
    ]
}
