{
    "version": "https://jsonfeed.org/version/1",
    "title": "Byte&#x27;s Projects",
    "description": "",
    "home_page_url": "https://byteafterlife.github.io/projects",
    "feed_url": "https://byteafterlife.github.io/projects/feed.json",
    "user_comment": "",
    "author": {
        "name": "Byte"
    },
    "items": [
        {
            "id": "https://byteafterlife.github.io/projects/my-jitsi-project-is-really-getting-huge-client-certificate-authentication/",
            "url": "https://byteafterlife.github.io/projects/my-jitsi-project-is-really-getting-huge-client-certificate-authentication/",
            "title": "My Jitsi Project is really getting huge (client certificate authentication)",
            "summary": "So in my last post of the Jitsi series, I explained how I did IP based blocking to control who can connect via a reverse proxy, but then I realized something. My IP can change, especially on mobile data. Which is bad, because then I&hellip;",
            "content_html": "\n  <p>\n    So in my <a href=\"https://byteafterlife.github.io/projects/my-silly-access-denied-page/\">last post</a> of the Jitsi series, I explained how I did IP based blocking to control who can connect via a reverse proxy, but then I realized something. My IP can change, especially on mobile data. Which is bad, because then I wont be able to call on the go, very bad! So what did I do? Well I decided to try client certificate authentication, how it works is you basically install a certificate on your device (in this case, my phone) which is a file that basically proves your identity, then when my reverse proxy asks my phone to give a certificate and I pick the one, it checks if the certificate you provide was created by me and its valid, and if yes, then it grants you access, even if your IP isn't authorized, and if you dont provide a certificate, or dont have (a valid) one, but your IP is authorized, you're allowed access, and finally if your IP isn't authorized and you dont provide a valid certificate, you are just rejected access with my silly block page.\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/14/Screenshot_20251221_142521_Key-Chain~2.jpg\" height=\"2340\" width=\"1080\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-xs.jpg 640w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-sm.jpg 768w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-md.jpg 1024w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-lg.jpg 1366w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-xl.jpg 1600w ,https://byteafterlife.github.io/projects/media/posts/14/responsive/Screenshot_20251221_142521_Key-Chain~2-2xl.jpg 1920w\">\n      <figcaption>My phone asking me to select a certificate to log into the srver</figcaption>\n    </figure>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-21T14:23:26-06:00",
            "date_modified": "2025-12-21T14:30:38-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/my-silly-access-denied-page/",
            "url": "https://byteafterlife.github.io/projects/my-silly-access-denied-page/",
            "title": "My silly access denied page",
            "summary": "I never expected my jitsi setup to get this complicated. Yesterday I had to build a custom auth server for JWT, today I had to setup IP controls. Basically, some weird data center company which I won't be naming keeps trying to access some weird&hellip;",
            "content_html": "\n  <p>\n    I never expected <a href=\"https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/\">my jitsi setup</a> to get this complicated. Yesterday I had to build a custom auth server for JWT, today I had to setup IP controls. Basically, some weird data center company which I won't be naming keeps trying to access some weird paths like \"/SETTINGS.CFG\" or \"/MainLogin.asp\" which don't even exist and instead make them join a jitsi meeting called \"Settings Cfg\" and \"MainLogin Asp\" lmao. So I decided to make my own access denied page once and for all to deal with them.\n  </p>\n\n  <p>\n    See, I'm tired of the boring old 403 pages like \"Access denied\" or \"Failure!\" No no no. This is my server, I style it how I want. So I made my access denied page have a personality. Best one I've ever seen. Here's a screenshot\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/13/Screenshot-from-2025-12-21-13-06-07.png\" height=\"1079\" width=\"1919\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/13/responsive/Screenshot-from-2025-12-21-13-06-07-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Like it?\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-21T13:06:30-06:00",
            "date_modified": "2025-12-21T14:23:40-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/",
            "url": "https://byteafterlife.github.io/projects/jitsi-is-complicated-how-i-fixed-it-is-wild/",
            "title": "Jitsi is... complicated. How I fixed it is wild.",
            "summary": "As a followup to my Jitsi setup post. I decided I need something more flexible, JWT authentication. Now, I remember I mentioned using plugins to setup auto lobby starting. But today, I needed a new plugin, (not responsible for external content)&nbsp;token_moderation. But it didn't work,&hellip;",
            "content_html": "\n  <p>\n    As a followup to my <a href=\"https://byteafterlife.github.io/projects/bye-mumble-hello-jitsi/\">Jitsi setup post</a>. I decided I need something more flexible, JWT authentication. Now, I remember I mentioned using plugins to setup auto lobby starting. But today, I needed a new plugin, (not responsible for external content)&nbsp;<a href=\"https://github.com/nvonahsen/jitsi-token-moderation-plugin/blob/master/mod_token_moderation.lua\">token_moderation</a>. But it didn't work, my logs said\n  </p>\n<pre class=\"line-numbers  language-html\"><code>modulemanager error Unable to load module 'token_moderation': /usr/lib/prosody/modules/share/lua/5.4/mod_token_moderation/mod_token_moderation.lua: No such file or directory</code></pre>\n\n  <p>\n    and I was confused. Because plugins are supposed to be read from\n  </p>\n<pre class=\"line-numbers  language-html\"><code>/prosody-plugins-custom\n</code></pre>\n\n  <p>\n    But it was reading them from that /usr/lib thing, I was confused. I checked the compose, it was mapping it as\n  </p>\n<pre class=\"line-numbers  language-html\"><code>- ${CONFIG}/prosody/prosody-plugins-custom:/prosody-plugins-custom:Z</code></pre>\n\n  <p>\n    just as the OFFICIAL FILE (remember that for later) wrote. So then I checked the container itself inside \"/prosody-plugins-custom\" and guess what? It wasn't even there. I was so confused, because it was loading the auto lobby start plugin successfully, this one it wasn't, and none were even showing up in the folder.. this makes no sense. But then I checked the folders inside \"/\" (the root) and I found one called \"prosody-plugins-contrib\" HUH??? And I opened it.. oh my god. It had all the plugin I used last post.. HARD WIRED INTO THE DEPLOYMENT? So here's what was happening: None of the custom plugins I added were ever added to jitsi's access in the first place, the auto lobby worked though. BUT THATS BECAUSE IT WAS IN A BUILTIN FOLDER THAT INCLUDED EVERY PLUGIN FROM THE REPOSITORY I DOWNLOADED THE AUTO LOBBY ONE FROM. So it was never getting it from \"/prosody-plugins-custom\" Ok.. that made more sense, because the folder was empty, so at least it wasn't pulling the auto lobby out of thin air.. but why was it empty? Well, I checked the mount path again,\n  </p>\n<pre class=\"line-numbers  language-html\"><code>- ${CONFIG}/prosody/prosody-plugins-custom:/prosody-plugins-custom:Z</code></pre>\n\n  <p>\n    And then I thought, ok well what's \"CONFIG\" AND THEN IT HIT ME.. CONFIG IS \"~/.jitsi-meet-cfg\" and I then realized.. it was reaading /prosody-plugins-custom from MY HOME DIRECTORY, NOT FROM THE PROJECT FOLDER. So I changed \"CONFIG\" to \"./\" (here's the .env update incase you had the same issue):\n  </p>\n<pre class=\"line-numbers  language-html\"><code>  CONFIG=./</code></pre>\n\n  <p>\n    And guess what.. it worked\n  </p>\n\n  <p>\n    This may seem simple but oh my, look from my perspective at the start: I put two plugins in the same folder, one loads fine, other is marked as not found, the folder according to Jitsi itself is empty, so how does the first one load fine, it it spawning it out of thin air!?\n  </p>\n\n  <p>\n    I don't know if I should be more concerned about the fact that the official example is that confusing, or that they hardbaked every contrib plugin into the official docker compose file.\n  </p>\n\n  <p>\n    Either way, as a summary, what happened is when I added those two plugins to the custom plugins folder that I THOUGHT would work, it didn't because CONFIG was set to the wrong folder on my host, it never actually was reading the auto lobby one from the custom plugins folder, which was empty according to it, it was instead reading it from a hard wired folder that was in it, which made me think it was reading it correctly, then when I added a plugin NOT from the contrib repository, since it wasn't hard baked into the image, it didn't even see it in the custom plugins, because it never saw anything in the custom plugins because \"${CONFIG}\" was set to the wrong value this whole time. Once I changed it to \"CONFIG=./\" the custom plugins folder was no longer empty, and it saw all my custom plugins again, yay. How confusing. I find it wild that I figured all that out. Also of course, no documentation told me that there was this hard baked folder, and nothing explained how to fix it. So I had to figure all this out myself. And somehow suceeded.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-20T14:26:42-06:00",
            "date_modified": "2025-12-20T14:46:08-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/ssh-tunneling-is-cooler-than-i-thought/",
            "url": "https://byteafterlife.github.io/projects/ssh-tunneling-is-cooler-than-i-thought/",
            "title": "SSH tunneling is cooler than I thought",
            "summary": "I've known about SSH tunnelling for a long time, I never actually know how it works though. Now I learned how it actually works and it's so much better. Basically how it works is if you want to access things on another computer that are&hellip;",
            "content_html": "\n  <p>\n    I've known about SSH tunnelling for a long time, I never actually know how it works though. Now I learned how it actually works and it's so much better. Basically how it works is if you want to access things on another computer that are locked down, you can use a program called SSH to make a tunnel into that computer and access the things on it, and it also binds to a port, which is kind of like a room in your computer, and forwards it to another room in the other computer, so lets say on port 8080 on your remote computer, you're hosting a secret website, but it can't be accessed through the internet for whatever reason, or doesn't have HTTPS. You can make an SSH tunnel into the computer, and as long as SSH can be accessed from anywhere, anything on that computer can be accessed from anywhere. It's pretty cool. It also encrypts stuff so if your program can't encrypt connections when needed, like no HTTPS, SSH does it for you.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-20T10:57:54-06:00",
            "date_modified": "2025-12-20T10:57:54-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/i-made-my-own-encoding-language-out-of-shapes/",
            "url": "https://byteafterlife.github.io/projects/i-made-my-own-encoding-language-out-of-shapes/",
            "title": "I made my own encoding language.. out of shapes",
            "summary": "Firstly, I'll just say, I get lots of ideas that I then later discover were thought of like 2 decades ago by someone else, so if this is another one of those times and someone already made this, then sorry, I didn't research it or&hellip;",
            "content_html": "\n  <p>\n    Firstly, I'll just say, I get lots of ideas that I then later discover were thought of like 2 decades ago by someone else, so if this is another one of those times and someone already made this, then sorry, I didn't research it or anything, I just made this for fun. Also this went through many revisions because I got more ideas for what to add and probably will get more, if they do, I'll make sure to post it here!\n  </p>\n\n  <p>\n    So I was bored one day and came up with a encoding language.. There's 2 rows. One is the \"grouping\" row, the next is the \"index\" row as I call it, you group the alphabet letters into groups of 3, so group 1 is \"ABC\", group 2 is \"DEF\", 3 is \"GHI\", and group 9 is \"YZ\" now, originally I didnt plan to use shapes, I planned to use dots. Anyway how the rows used to work is the first row, the \"grouping\" row is for which group of letters your letter is in, let's say I want to write the message \"Hi\" what we'd do is since the letter \"H\" is in the \"GHI\" group, which is 3, we put 3 dots in the first column, first row, to represent \"GHI.\" by the way you can make these rows with just some simple lines, nothing complicated like a special algorithm for the columns. Now, in the second row, first column, we'd put two dots, why? well H is 2nd in the \"GHI\" group just like that, we wrote H in my silly language, for I, 2nd column first row would be 3 dots again for \"GHI\", then 3 dots 2nd row 2nd column for I. And we just wrote \"HI\" (haven't invented capitalisation yet!) Also I didn't really make a requirement for how the dots have to be placed, you can put them in a straight line, a triangle for 3, square for 4, whatever, as long as its within the row and row and column. Here's what it would look like saying \"HI\"\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl1-2.png\" height=\"230\" width=\"209\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl1-2-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Also I made sure to place the dots randomly to show THE DOT PLACEMENT DOESNT MATTER as long as its contained in your cell (row and column). Now, this was V1 of my secret language, so once when I arranged the dots like a triangle, I realized \"Wait why don't we just use shapes?\" So I decided to use shapes. Also you may use a dot for 1, so for \"A\" you would put a dot in column 1 row 1, and another in column 1 row 2. Now \"HI\" looked like this:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl2.png\" height=\"230\" width=\"209\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl2-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Also the orientation doesn't matter of the shape, you can make horizontal or vertical lines, upside down triangles, sideways triangles, squares at a 45 degree angle, anything, as long as the vertices match what you want. Simply just count the vertices and that's the dot, a triangle has 3 vertices, so that equals \"3\" or the 3rd group, \"GHI\" and a line has 2, the 2nd letter in the GHI group, just like that, we got \"HI\" but out of shapes. Then in class when I was experimenting with it, I realized.. \"Wait what if I just flipped it upside down\" Since the orientation of the shapes doesn't matter to me, you can make a upside down triangle, but now what if you got it upside down (the H and I on the top is just for guidance, if using for real, which I'd be surprised if you did, you wouldn't write the decoded letter above it) So what if you got it upside down, then it would look like this?\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl3.png\" height=\"230\" width=\"215\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl3-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    Now it says \"IF\".. HUH? NO! I wanted to say Hi! NOT IF. So what did I do? make an orientation symbol. The orientation symbol is an \"O\" with a line under it. and it always goes on top of the code. So Hi would look like this now with V3 (my orientation symbol update lol)\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl4.png\" height=\"321\" width=\"214\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl4-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    You just gotta follow the global rule of \"O symbol is always above\" now if i turn it any direction, the O symbol wouldn't be on top, which would signal to the reader to fix the orientation. Also, once when I wanted to write \"S\" I didn't feel like drawing a shape with 7 sides, so you can also put multiple shapes into a cell as long as the vertices add up to what you wanted&nbsp;originally, so a square and a triangle's vertice count adds up to 7, which would be the \"STU\" group. then draw a simple dot for the 1st letter in \"STU\", \"S\" and you got S. Here's an example:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl5.png\" height=\"262\" width=\"162\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl5-2xl.png 1920w\">\n      <figcaption>S</figcaption>\n    </figure>\n\n  <p>\n    Now, here's a challenge, try decoding this, it's a bit hard, remember orientation!:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl6.png\" height=\"696\" width=\"415\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl6-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    (DO NOT SCROLL FURTHER UNLESS DONE OR AREN'T DOING IT, YOU WILL SEE THE ANSWER)\n  </p>\n\n  <p>\n    (DO NOT SCROLL FURTHER UNLESS DONE OR AREN'T DOING IT, YOU WILL SEE THE ANSWER)\n  </p>\n\n  <p>\n    (DO NOT SCROLL FURTHER UNLESS DONE OR AREN'T DOING IT, YOU WILL SEE THE ANSWER)\n  </p>\n\n  <p>\n    If you have trouble, the answer is YOUREAWESOME\n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    Also the 2nd row should always have less than 4 vertices. Since letters are grouped in 3, and a group cannot have more than 3, if you see a square in the second row ( with correct orientation, of course) then it's a mistake since a square has 4 vertices\n  </p>\n\n  <p>\n    I also made another edition called \"Additive\", which instead of using groups and indexes of letters in those groups, uses the closest group to the letter, and the second row is addition to get to that letter. So D would be a single dot in the top row, which would be.. \"ABC\"? What??? Yes, in my first edition, that wouldn't make sense. But in this edition, the second row would be one more dot, which would signal \"what's 1 letter after C?\" which is D. so D would look like this in my Additive edition:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/sl7.png\" height=\"138\" width=\"150\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/sl7-2xl.png 1920w\">\n      \n    </figure>\n\n  <p>\n    The first row always equals the last letter of the group, so if you drew a triangle, which would mean the group \"GHI\", \"I\" would be the letter, then the second dot would be what you want to add, so if you want to write \"K\", you would make a triangle in the top row for \"GHI\", then the second row would have a line or any other two vertices shape, which would mean \"I\" + 2, which would be \"K\"\n  </p>\n\n  <p>\n    This is a really silly idea I had, if you want to try using it, have fun! Much thanks for reading. Also I know this isn't my usual tech stuff but I found it a fun post to make for those interested in encoding and stuff.\n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    UPDATE: I concluded theres no way to add spaces, so like if you wanna add a space, just keep one column empty, so \"Hi there\" now looks like:\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/10/slupdate.png\" height=\"177\" width=\"338\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/10/responsive/slupdate-2xl.png 1920w\">\n      \n    </figure>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-06T09:57:11-06:00",
            "date_modified": "2025-12-21T09:22:18-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/bye-mumble-hello-jitsi/",
            "url": "https://byteafterlife.github.io/projects/bye-mumble-hello-jitsi/",
            "title": "Bye Mumble, Hello Jitsi",
            "summary": "So, as I discussed in my Mumble setup&nbsp;post, I made my own mumble server and port forwarded to make it accessible to the world! However, my family didn't like the limits: No video, no screensharing. Now, I've known about Jitsi Meet for a while. Not&hellip;",
            "content_html": "\n  <p>\n    So, as I discussed in my <a href=\"https://byteafterlife.github.io/projects/my-first-worldwide-project-mumble/\">Mumble setup</a>&nbsp;post, I made my own mumble server and port forwarded to make it accessible to the world! However, my family didn't like the limits: No video, no screensharing. Now, I've known about <a href=\"https://jitsi.org\">Jitsi Meet</a> for a while. Not the cloud hosted one they provide, but the self hosted one. Jitsi Meet is a self hostable server app that lets you have meetings with people (screenshare and video and much more included) Now I'm gonna be completely transparent and say I've failed lots of times setting up an actually working Jitsi server. But this time it was surprisingly easy, I downloaded their pre-made <a href=\"https://byteafterlife.github.io/projects/the-docker-rabbit-hole/\">docker</a> compose file, it worked surprisingly! I was expecting 3 hours of debugging to just get the welcome screen, let alone a working meeting. But surprisingly, it worked first try, I got into a meeting, and everything was working. Now, I needed some form of authentication, if this was internally running on my LAN network, it wouldn't matter too much, but if I'm gonna port forward this and make it publicly accessible, I need some sort of security. Then I found myself configuring it to use an LDAP backend, and I added to the docker compose file an <a href=\"https://github.com/lldap/lldap\">LLDAP</a>&nbsp;(Light LDAP) (not LDAP) server. LLDAP is the simplest implementation of an LDAP server I know. It requires minimal setup, and definitely doesn't require 1 hour of commands to add an attribute. It even includes a web interface to manage users. Awesome! Now I was originally considering using Jitsi's internal user system for authentication, because Jitsi's user auth manager, prosody, lets you just internally create users with passwords in it's database and you can use that. But I like a clean web UI, so yes, I deployed a LDAP server just so I get a pretty web interface for managing users. I don't care that much, this isn't a enterprise grade server for millions of concurrent clients, I'm running these off my laptop for ~4 people, so I don't mind too much on resource usage. So just like that, my stack is done! Jitsi meet + LDAP for user management was epic. Then I setup the port forwarding and stuff, and just like that, we did it! Here's some screenshots.\n  </p>\n\n  <div  class=\"gallery-wrapper gallery-wrapper--wide\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-02-53.png\" data-size=\"1919x951\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-02-53-thumbnail.png\" height=\"357\" width=\"720\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-01-06.png\" data-size=\"590x141\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-01-06-thumbnail.png\" height=\"141\" width=\"590\" alt=\"\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-04-06.png\" data-size=\"416x385\">\n        <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/9/gallery/Screenshot-from-2025-12-06-09-04-06-thumbnail.png\" height=\"385\" width=\"416\" alt=\"\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n  <p>\n    UPDATE: Ok so something was very wrong, any user that joins gets moderator rights... so what I had to do is enable guests, then take a completely different approach. Instead of everyone in my family having an account on LDAP, I just have one, since I guess Jitsi just gives all LDAP users moderator in meetings. But now that guests are enabled, anyone can join the meeting. The only time they cant is when a moderator isn't in the meeting, but if a moderator is in the meeting, they can just join, now I could enable the lobby, which would 100% solve the problem, but what if I forget? Well I just discovered a <a href=\"https://github.com/jitsi-contrib/prosody-plugins/tree/main/lobby_autostart_on_owner\">community made plugin called \"lobby_autostart_on_owner\"</a>&nbsp;(not responsible for external content) that automatically enables the lobby after a moderator joins to prevent users from joining without a moderator's permission. Gotta love open source. So the new flow: Only I have an account, the lobby is automatically enabled whenever I join so I don't have to remember to myself. Fine solution for now I guess, I also removed LLDAP completely since all that just for one user account is a bit too much, so now its just internally managed via that prosody internal database I mentioned earlier.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-12-06T08:50:38-06:00",
            "date_modified": "2025-12-20T14:27:32-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/i-made-my-own-vpn/",
            "url": "https://byteafterlife.github.io/projects/i-made-my-own-vpn/",
            "title": "I made my own VPN (second worldwide project)",
            "summary": "Everytime on my phone when I use my Mobile Data, or connect to an open wifi like at an airport or store, people say it's good to use a VPN, now when people think of VPNs they think of something that you pay for and&hellip;",
            "content_html": "\n  <p>\n    Everytime on my phone when I use my Mobile Data, or connect to an open wifi like at an airport or store, people say it's good to use a VPN, now when people think of VPNs they think of something that you pay for and it masks your IP anywhere you go, that's true, that's what a common VPN does. But, the way VPNs work is basically you pay to be able to connect to a network of computers that are told to forward your network requests (loading a webpage, making a search, logging in, etc) through them. It's actually really easy to make your own VPN server, and it probably costs less too, get a VPS (not a VPN) which is basically your own computer in the cloud that you rent, yes it's still paid, what do you expect. It functions just like you owned a computer at your house, except its in the cloud, now you run VPN software on it (OpenVPN, WireGuard, etc), set it up, connect, and you're done, now anywhere you go, your IP is now of the cloud computer that you're renting. However since I don't get funded for any of my projects, what if instead of running this VPN software on a cloud computer, I ran it on my own? I trust my own wifi router more than some random coffee shop wifi anyway, so I setup my very own WireGuard server, and then configured it on my phone, yes by the way I had to also setup port forwarding and firewalls, I'm trying to expand my knowledge of port forwarding and know better at making worldwide accessible servers from my computer, like the <a href=\"https://byteafterlife.github.io/projects/my-first-worldwide-project-mumble/\">Mumble server</a> I made 2 days ago, which also involved port forwarding and firewall config. Anyway back to WireGuard, now, here's the flow\n  </p>\n\n  <p>\n    My phone connects to mobile data or a public wifi &gt; I turn connect to my laptop's worldwide accessible VPN &gt; Any network traffic I do like searching or loading a webpage is extremely hard to be seen by the admins of the wifi I connected to &gt; My laptop makes the network request using my router at home &gt; router completes the request &gt; sends it to my laptop which sends it back to my phone, done.\n  </p>\n\n  <p>\n    Here's an example if I wanted to search \"hi\" on google: Phone searches hi (connected to my laptop VPN) &gt; Laptop searches it up using the home Wifi, as if I was at home and I searched \"hi\" using the home wifi &gt; the router responds and gives me the results &gt; my laptop returns it back to my phone which could be wherever in the world.\n  </p>\n\n  <p>\n    Of course I used docker to keep my docker skills sharp.\n  </p>\n\n  <p>\n    Heres a mobile screenshot\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/8/Screenshot_20251130_155702_WireGuard.jpg\" height=\"2340\" width=\"1080\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-xs.jpg 640w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-sm.jpg 768w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-md.jpg 1024w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-lg.jpg 1366w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-xl.jpg 1600w ,https://byteafterlife.github.io/projects/media/posts/8/responsive/Screenshot_20251130_155702_WireGuard-2xl.jpg 1920w\">\n      \n    </figure>\n\n  <p>\n    This is now my second worldwide accessible project EVER. And only 3 days after my first one. Woo!\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-11-30T13:00:44-06:00",
            "date_modified": "2025-11-30T15:58:37-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/using-linux-as-my-main-os-for-the-first-time/",
            "url": "https://byteafterlife.github.io/projects/using-linux-as-my-main-os-for-the-first-time/",
            "title": "Using Linux as my Main OS for the first time",
            "summary": "Ever since August 2024, I've been using Linux as my main OS. Why? Well it's more private, they don't install unnecessary apps like other OS's, and you can customize it as much as you want. Simple. I also like it because lots of servers use&hellip;",
            "content_html": "\n  <p>\n    Ever since August 2024, I've been using Linux as my main OS. Why? Well it's more private, they don't install unnecessary apps like other OS's, and you can customize it as much as you want. Simple. I also like it because lots of servers use it and in the future if I administer servers, learning linux is good, so far I know alot, package managers, software, fun easter eggs, etc. I like it, I also like something called \"LUKS\" which is basically a encryption system that encrypts your drive data, I'm not interested in that part, I like the way it stores the encryption key.. Instead of your password being the encryption key, the encryption key is actually a random string from what I know, and THAT string is encrypted with your password, so your password is used to get that encryption key to decrypt your data. But with that.. You can setup multiple \"slots\" or holders of that encrypted encryption key copy.. Like a security key could hold the same encryption key, and decrypt your data. I find it a creative idea!\n  </p>\n\n  <p>\n    Also, as I said it's really customizable. I added a notepad widget to my screen, a extension to make my screen more red, and way more that's not included in this screenshot, but here's my desktop.\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/7/Untitled-2025-11-07-1049.png\" height=\"826\" width=\"1452\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/7/responsive/Untitled-2025-11-07-1049-2xl.png 1920w\">\n      \n    </figure>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-11-29T09:09:20-06:00",
            "date_modified": "2025-11-29T09:36:31-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/networking/",
            "url": "https://byteafterlife.github.io/projects/networking/",
            "title": "Networking",
            "summary": "Oh where do I start, I'll just say, theres probably way more than what I mention here to networking since it's such a broad term, but I'll say what I know. Lots of people know the basics, Wifi, Ethernet, \"Knowing someone's IP address = I'm&hellip;",
            "content_html": "\n  <p>\n    Oh where do I start, I'll just say, theres probably way more than what I mention here to networking since it's such a broad term, but I'll say what I know.\n  </p>\n\n  <p>\n    Lots of people know the basics, Wifi, Ethernet, \"Knowing someone's IP address = I'm a super cool hacker\" (I'm explaining why that last one is wrong btw)\n  </p>\n\n    <h2 id=\"ip-basics\">\n      IP Basics\n    </h2>\n\n  <p>\n    Firstly, lets start with IP's since they found alot of networking from what I know. So, there's two types of IP's. Theres \"private IPs\" and \"public IPs\" how they work is when you connect to a Wifi network or connect via ethernet, the router gives your device (phone, laptop, tablet, computer) this magic number called a Private IP, this is used for the router to identify you, and also so other devices can identify you, if your device is also hosting a server (mine has hosted many ;D) then other devices on that same network (example: wifi network) can use the private IP the router assigned you to access that server that your device is hosting. Now, what if you want people outside your (wifi) network to access your server? Well then people will need your Public IP and you'll need to change some router settings.\n  </p>\n\n  <p>\n    So, you're hosting a minecraft server on your computer and you want your friends to join but they arent on your wifi network? Cool! Here's an explination. First: Go to your router settings, now, this varies by router. Now, go to port forwarding (some call it something else), setup port forwarding (I can't be specific because again it's specific to your router brand and model, but you can usually just google \"(your router creator and model) port forwarding tutorial\" and you'll see step by step), then run the server on your computer, make sure your firewall allows the connections, and you're done. this applies to any server, not just minecraft. Now, your friends will use (your public IP):(port) to connect.\n  </p>\n\n  <p>\n    Also, just to reenforce private IP's are network specific, let me make 2 examples. First, technical one. Lets say my private IP the router gave my laptop is 192.168.56.12, well, if my friend on a different wifi network tries connecting to 192.168.56.12, they can't, the router will be confused, unless the router assigned 192.168.56.12 to another device like maybe his phone then he'd be connected to his phone, not my laptop. Here's a real life example, pretty easy to understand. Let's say you have a room, 1st door 2nd floor. If your friend went to his 2nd floor in his house and opened the 1st door, he wouldn't be in your room. Simple.&nbsp;\n  </p>\n\n    <h4 id=\"domains-intro\">\n      Domains intro\n    </h4>\n\n  <p>\n    But here's the problem, this is a good setup for a one time event, but what about for a 24/7 server? Well you may be wondering \"What's the problem now? I set everything up, it should be ok forever now right?\" WRONG. Ok so basically most router's that are for home use, like your or my parent's router change the public IP! I know, shameful. lol. So, how do we deal with that? Well so far my best solution is Domains. What are domains? Welcome to the next chapter.\n  </p>\n\n    <h2 id=\"domains\">\n      Domains\n    </h2>\n\n  <p>\n    Domains, you see them everywhere, google.com, example.com, this website right here is on a domain! But what are they? Ever wondered whats happening behind the scenes when you hit enter after typing \"google.com\" Probably not, I don't blame you honestly. WELL TOO BAD you've read everything before this part already so that means you're interested in what I have to say (thanks!) So, domains have these things called records, there are lots of types of records, to be honest I don't understand many, but most websites use CNAME or A, those basically point to a server from what I know. A points to an IP, I don't really know how CNAME works honestly. So, here's how you would setup a domain for your minecraft server.\n  </p>\n\n    <h2 id=\"minecraft-server-sample\">\n      Minecraft server sample\n    </h2>\n\n  <ol>\n    <li>Make sure you setup port forwarding, the minecraft server itself, and your firewall is ready</li><li>Get your Public IP (you can search \"what is my ip\")</li><li>Go to your domain and make an A record, set the value to the public IP you got</li><li>You're done.</li>\n  </ol>\n\n  <p>\n    Lets say the domain you got is example.org, and your minecraft server is on port 25565, here's how it would work behind the scenes:\n  </p>\n\n  <ol>\n    <li>Your friend types example.org:25565</li><li>Your computer looks up the records for example.org</li><li>It finds the A record leading to your public IP (lets say 1.1.1.1)</li><li>It connects to 1.1.1.1:25565</li><li>Your router (1.1.1.1) checks it's port forwarding settings for port 25565</li><li>It see's you made a setting to forward port 25565 to port 25565 on your computer</li><li>Your router connects to <u><em>port</em></u> 25565 on your computer and <em><u>forwards</u></em> all data sent through your friend's computer to yours.</li>\n  </ol>\n\n  <p>\n    So basically your router is this huge proxy that points connections to the right place.\n  </p>\n\n    <h2 id=\"the-i-know-your-ip-i-own-you-theory\">\n      The \"I know your IP, I own you\" theory\n    </h2>\n\n  <p>\n    Ever been online and seen people threatening each other with their IP's or something, saying they know where the person lives or whatever, yeah thats actually a lie. Firstly, this IP they're talking about is the person's Public IP as we learned previously. Well, your ISP (the people that you pay for internet) has a building somewhere in your city or another city, and that's where your public IP's location is usually. Not your house. Sometimes, if your ISP doesn't have a building in your city, your public IP's location may even be set to the city beside yours because that's the closest building your ISP has.\n  </p>\n\n    <h2 id=\"done\">\n      Done\n    </h2>\n\n  <p>\n    I probably know more about networking, right now I just can't think of anything else. Sorry!\n  </p>\n\n  <p>\n    There's also SSL certificates and that stuff but I think thats a topic for a different time.\n  </p>",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-11-29T08:46:20-06:00",
            "date_modified": "2025-11-29T09:32:51-06:00"
        },
        {
            "id": "https://byteafterlife.github.io/projects/my-first-worldwide-project-mumble/",
            "url": "https://byteafterlife.github.io/projects/my-first-worldwide-project-mumble/",
            "title": "My first worldwide project (Mumble)",
            "summary": "Before I start, I'll just say, this is a huge milestone in my adventures, I am pretty proud of myself for making this work. I woke up one day (yesterday), and as someone who loves open source and self hosting, I decided to run my&hellip;",
            "content_html": "\n  <p>\n    Before I start, I'll just say, this is a huge milestone in my adventures, I am pretty proud of myself for making this work.\n  </p>\n\n  <p>\n    I woke up one day (yesterday), and as someone who loves open source and self hosting, I decided to run my own Mumble server, If you don't know what Mumble is, it's basically this server code that you run to make your own voice call server that others can talk on. Now I've run plenty of servers before that are only accessible on my LAN. Simplified, the way networking works (if you wanna know in more detail, read <a href=\"https://byteafterlife.github.io/projects/networking/\">this post</a>) is unless you change some settings on your router, any server your computer runs cannot be seen by the rest of the world, it can only be accessed on people that are on the same network (are connected to the same wifi as you or ethernet or whatever you use to connect) as you. If not, they cannot access it. But, today I decided is the day I make it accessible anywhere. Firstly, I setup the Mumble server itself with <a href=\"https://byteafterlife.github.io/projects/the-docker-rabbit-hole/\">Docker</a>, then I tested it. It works. Now was the hard part, the part I never did before. To those who have done this before, it may seem small, but this was my first time, it was really exciting! So I went into my parents router settings (they don't mind), and looked up how to setup port forwarding on my router model (it was pretty complicated) but eventually it worked! I had to make a \"custom service,\" specify ports, connect it to my computer through some weird UI, but in the end, I did it! I got it so if you connect to port&nbsp;64738 (default mumble port) through my public IP (the magical number the world uses to connect to your servers and router) it routes you to my computer's mumble server! Perfect.\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://byteafterlife.github.io/projects/media/posts/5/Screenshot-from-2025-11-29-08-52-00.png\" height=\"144\" width=\"619\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://byteafterlife.github.io/projects/media/posts/5/responsive/Screenshot-from-2025-11-29-08-52-00-xs.png 640w ,https://byteafterlife.github.io/projects/media/posts/5/responsive/Screenshot-from-2025-11-29-08-52-00-sm.png 768w ,https://byteafterlife.github.io/projects/media/posts/5/responsive/Screenshot-from-2025-11-29-08-52-00-md.png 1024w ,https://byteafterlife.github.io/projects/media/posts/5/responsive/Screenshot-from-2025-11-29-08-52-00-lg.png 1366w ,https://byteafterlife.github.io/projects/media/posts/5/responsive/Screenshot-from-2025-11-29-08-52-00-xl.png 1600w ,https://byteafterlife.github.io/projects/media/posts/5/responsive/Screenshot-from-2025-11-29-08-52-00-2xl.png 1920w\">\n      <figcaption>\"AONEM\" is the nickname I gave for mumble, HTTP was also needed because later on I got a Lets Encrypt certificate for SSL, which was also a big achievement</figcaption>\n    </figure>\n\n  <p>\n    But now here's another problem.. most home routers change your public IP, that's bad. By the way, this mumble server was just for me and my family to decentralise from corporations and whatnot. So if the public IP changed, my family would need to change it all on their computers too, that would be annoying and a waste of time. So I realized something. You know domains right? Like example.com, or example.org, well, those are kind of aliases for IP addresses, like google.com is pointing to 142.250.191.142 as of the time I'm writing this,&nbsp;142.250.191.142 is google's public IP right now, don't believe me? Go open your browser, and type&nbsp;142.250.191.142 as the URL. Magic right? Nope, just <a href=\"https://byteafterlife.github.io/projects/networking/\">networking</a>&nbsp;basics. So anyway, the thing is.. these aliases can change. So what if instead of asking my family to use the public IP of my router as the address to connect to the Mumble server and have to manually change it everytime my router changes it's public IP, what if instead, I just got a domain, and anytime the public IP changed, I update the IP the domain is pointing to. This is actually a popular concept known as \"Dynamic DNS\" which from what I understood does exactly what I needed. Well, here's the problem, domains cost money. But, theres a free service that allows you to get free subdomains. So I got all the puzzle peices now! I got a domain, my port forwarding setup, the mumble server works. Now I just need to setup the domain and everything should work, right? Well, you'll find out later. So I made the domain record, setup Dynamic DNS by making a quick script that gets my public IP every 15 minutes, and sends it to the domain, if it changed, the domain forwards to my new public IP, if not, nothing changes. That's basically dynamic DNS, here's my script if you want. I had to censor alot because it includes login credentials and other private stuff.\n  </p>\n<pre class=\"line-numbers  language-html\"><code>  #!/bin/bash\nUSERNAME=\"(secret)\"\nPASSWORD='(secret)'\nDOMAIN=\"(secret, kinda).privatedns.org\"\nIP=$(curl -s https://ipv4.icanhazip.com)\n\ncurl -k \"https://${USERNAME}:${PASSWORD}@(secret)/nic/update?hostname=${DOMAIN}&myip=${IP}\"\n\n</code></pre>\n\n  <p>\n    Since I'm using linux, I setup something called a \"cron\" job (that is basically an automated task scheduler) to run this script every 15 minutes. And guess what? It worked. If my public IP ever changes, my family just needs to wait a max of 15 minutes before my computer detects it and the domain is realigned with my router's new IP.\n  </p>\n\n  <p>\n    Now, an even bigger thing I never done before, get an actual certificate! Certificates, in simple, encrypt your connection with websites, almost every uses them, this blog uses it, Google uses it, as I said, almost every website in the world does, it makes sure nobody except the website can see what you're sending to the website, like your name and password, and it makes sure nobody except you can see what the website sent back, like your bank balance or email address or phone number. Certificates can be made with a \"custom CA\" but devices only trust a specific list of CAs, so what's a CA, again I'm simplifying this but basically it's a trusted organization that issues these certificates, the most popular one for website certificates is Lets Encrypt, they're trusted very very widely. So, I put my domain into lets encrypt and basically asked them for a certificate, this is necessary because it encrypts the voice communication between the mumble server I made and my family so nobody can eavesdrop. Then they told me I need a http server to prove I own the server, which I also had to setup and port forward. But after a whole bunch of work, I got a certificate, I also decided to setup another cron job to renew the certificate everyday at 3am. That's the story of my Mumble server journey. Hope you learned something!\n  </p>",
            "image": "https://byteafterlife.github.io/projects/media/posts/5/Untitled-2025-11-07-1050.jpg",
            "author": {
                "name": "Byte"
            },
            "tags": [
            ],
            "date_published": "2025-11-29T08:44:34-06:00",
            "date_modified": "2025-11-29T09:43:59-06:00"
        }
    ]
}
